Migrate paula flow from PlantUML to Mermaid
